Autodesk.Revit.DB.Electrical.DistributionSysType.IsInUse
Get the value which indicates whether this distribution system is in service now.

Autodesk.Revit.DB.Electrical.DistributionSysType.VoltageLineToGround
Get or set line to ground voltage of distribution system type.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
The voltage retrieved here is read only and actions to modify its properties it will throw an System.InvalidOperationException.

Autodesk.Revit.DB.Electrical.DistributionSysType.VoltageLineToLine
Get or set line to line voltage type of distribution system type.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
The voltage retrieved here is read only and actions to modify its properties it will throw an System.InvalidOperationException.

Autodesk.Revit.DB.Electrical.DistributionSysType.NumWires
Get or set number of wires of distribution system.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException: While assign a negative value to NumWires.

Autodesk.Revit.DB.Electrical.DistributionSysType.ElectricalPhase
Get or set electrical phase (single, triple or undefined) of distribution system.

Autodesk.Revit.DB.Electrical.DistributionSysType.ElectricalPhaseConfiguration
Get or set electrical phase configuration (Y, delta or undefined) of distribution system.

Autodesk.Revit.DB.Electrical.DistributionSysType
Represents a specific type of distribution system.